{
  "intenciones": [
    {
      "etiqueta": "saludo",
      "patrones": [
        "Hola",
        "Buenas",
        "Buen día",
        "Buenas tardes",
        "Buenas noches",
        "Qué tal",
        "Hola, necesito información",
        "Hola, tengo una duda",
        "Buen día, una pregunta",
        "Hola chatbot",
        "Hey, qué onda",
        "Hola, eres el asistente de la UAdeC?"
      ],
      "respuestas": [
        "¡Hola! Soy el asistente virtual de la Universidad Autónoma de Coahuila. ¿En qué trámite te ayudo hoy?",
        "Bienvenido al chatbot de la UAdeC 🙌. Cuéntame, ¿qué trámite necesitas hacer?",
        "Hola, con gusto te apoyo con trámites de pagos, horarios, créditos, calendario y escolar. ¿Qué necesitas?"
      ]
    },
    {
      "etiqueta": "despedida",
      "patrones": [
        "Gracias, es todo",
        "Eso sería todo, gracias",
        "Ya no tengo dudas",
        "Muchas gracias",
        "Listo, gracias",
        "Hasta luego",
        "Nos vemos",
        "Adiós",
        "Bye",
        "Gracias por la ayuda",
        "Gracias, hasta luego"
      ],
      "respuestas": [
        "¡Hasta luego! Espero haberte ayudado con tus trámites de la UAdeC.",
        "Gracias por usar el asistente de la Universidad Autónoma de Coahuila. ¡Que tengas un excelente día!",
        "Fue un gusto ayudarte 😊. Si tienes más dudas de trámites, aquí estaré."
      ]
    },
    {
      "etiqueta": "pago_semestre",
      "patrones": [
        "Quiero pagar el semestre",
        "Cómo pago el semestre",
        "Dónde puedo pagar mi inscripción",
        "Ayuda con el pago de reinscripción",
        "No sé cómo pagar la colegiatura",
        "Qué pasos sigo para pagar el semestre",
        "Dónde genero la ficha de pago del semestre",
        "Pago de reinscripción UAdeC",
        "Pagar reinscripción en línea",
        "Cómo hago el pago del semestre en el banco",
        "Quiero saber cómo pagar mi inscripción",
        "Información sobre el pago del semestre"
      ],
      "respuestas": [
        "Para pagar tu semestre en la UAdeC, entra al portal de alumnos, genera tu ficha de pago y cubre el monto en los bancos autorizados o mediante pago en línea.",
        "El pago del semestre o reinscripción se realiza generando una referencia en el sistema de la UAdeC. Revisa el calendario escolar para conocer las fechas límite.",
        "Debes acceder al portal institucional con tu matrícula, ir a la sección de pagos o reinscripción y generar la ficha. Con esa referencia puedes pagar en línea o en banco."
      ]
    },
    {
      "etiqueta": "solicitar_creditos_educativos",
      "patrones": [
        "Cómo solicito un crédito educativo",
        "La UAdeC tiene créditos educativos",
        "Quiero un préstamo para pagar la escuela",
        "Qué opciones de financiamiento hay",
        "Crédito educativo para alumnos",
        "Cómo tramito un crédito estudiantil",
        "Hay préstamos o créditos para reinscripción",
        "Dónde pido información sobre créditos",
        "Requisitos para crédito educativo",
        "Información de financiamiento estudiantil",
        "Crédito para pagar el semestre",
        "Ayuda con trámites de crédito o financiamiento"
      ],
      "respuestas": [
        "Los créditos educativos se gestionan normalmente a través de Servicios Estudiantiles o Finanzas. Revisa la información en la página de la UAdeC o en tu facultad.",
        "Para solicitar un crédito educativo, revisa si hay convocatorias vigentes y prepara documentos como historial académico, identificación y comprobante de ingresos.",
        "La UAdeC puede tener convenios de financiamiento con instituciones externas. Te recomiendo acudir a Servicios Estudiantiles o al área de Finanzas de tu facultad para más detalles."
      ]
    },
    {
      "etiqueta": "pago_cuota_mantenimiento",
      "patrones": [
        "Qué es la cuota de mantenimiento",
        "Cómo pago la cuota de mantenimiento",
        "Dónde veo la cuota de mantenimiento",
        "No encuentro la cuota de mantenimiento",
        "Tengo duda sobre la cuota de mantenimiento",
        "Cuánto debo de cuota de mantenimiento",
        "La cuota de mantenimiento viene en el estado de cuenta",
        "Pago de cuota de mantenimiento UAdeC",
        "La cuota de mantenimiento se paga junto con el semestre",
        "Información sobre la cuota de mantenimiento",
        "Necesito pagar la cuota de mantenimiento",
        "Dónde aparece el cargo de mantenimiento"
      ],
      "respuestas": [
        "La cuota de mantenimiento suele aparecer como un concepto adicional en tu estado de cuenta. Puedes pagarla con la misma referencia o como un cargo separado según indique el sistema.",
        "Para pagar la cuota de mantenimiento, revisa tu estado de cuenta en el portal de alumnos y verifica el concepto y el monto. Luego puedes pagar en línea o en bancos autorizados.",
        "Si no ves la cuota de mantenimiento en tu estado de cuenta, te recomiendo contactar al departamento de Escolar o Finanzas de tu facultad para que revisen tu caso."
      ]
    },
    {
      "etiqueta": "consulta_estado_cuenta",
      "patrones": [
        "Quiero ver mi estado de cuenta",
        "Dónde consulto mi estado de cuenta",
        "No encuentro mi estado de cuenta",
        "Cuánto debo a la UAdeC",
        "Quiero saber cuánto debo",
        "Mi saldo pendiente con la universidad",
        "Cómo checo mis adeudos",
        "Cómo revisar mis pagos y cargos",
        "Estado de cuenta UAdeC alumnos",
        "No sé si ya se reflejó mi pago",
        "Dónde veo si ya pagué el semestre",
        "Cómo revisar mis adeudos escolares"
      ],
      "respuestas": [
        "Tu estado de cuenta se consulta en el portal de alumnos de la UAdeC, en la sección de Finanzas o Pagos. Ahí podrás ver cargos, pagos y adeudos.",
        "Para revisar tu estado de cuenta, entra con tu matrícula y contraseña al sistema institucional y busca la opción de 'Estado de cuenta' o 'Pagos'.",
        "Si no puedes acceder a tu estado de cuenta o ves información incorrecta, te recomiendo acudir al departamento de Escolar o Finanzas para que lo revisen."
      ]
    },
    {
      "etiqueta": "ayuda_horario",
      "patrones": [
        "Necesito ayuda con mi horario",
        "No sé cómo inscribir materias",
        "Cómo hago mi horario",
        "Cuándo puedo cargar materias",
        "Ayuda para seleccionar horario",
        "No entiendo cómo funciona la inscripción de materias",
        "Problemas para inscribir clases",
        "Qué hago si un grupo aparece lleno",
        "Cómo cambio de grupo en mi horario",
        "Consejos para armar mi horario",
        "Selección de horario UAdeC",
        "Fechas para hacer horario"
      ],
      "respuestas": [
        "La selección de horario se hace en línea en las fechas indicadas por la UAdeC. Debes revisar la oferta de materias de tu facultad y elegir los grupos disponibles.",
        "Para inscribir materias, entra al portal de alumnos, ve a la sección de inscripción o carga académica y selecciona las materias de acuerdo con tu plan de estudios.",
        "Te recomiendo tener varias opciones de grupos por si alguno aparece lleno. Si tienes problemas con la carga, acude al departamento escolar de tu facultad."
      ]
    },
    {
      "etiqueta": "consulta_calendario_escolar",
      "patrones": [
        "Dónde veo el calendario escolar",
        "Calendario escolar UAdeC",
        "Fechas importantes de la UAdeC",
        "Cuándo inicia el semestre",
        "Cuándo terminan clases",
        "Fechas de exámenes finales",
        "Fechas de reinscripción",
        "Calendario de pagos",
        "Necesito el calendario oficial",
        "Cuándo son las vacaciones",
        "Quiero ver el calendario de la facultad",
        "Dónde está el calendario académico"
      ],
      "respuestas": [
        "El calendario escolar de la UAdeC está disponible en la página oficial de la universidad, en la sección de Calendario o Fechas importantes.",
        "Puedes consultar el calendario escolar buscando en la web institucional de la UAdeC o en la página específica de tu facultad.",
        "En el calendario escolar encontrarás fechas de inicio y fin de semestre, periodos de pago, reinscripción y exámenes. Es importante revisarlo con frecuencia."
      ]
    },
    {
      "etiqueta": "consulta_creditos_escolares",
      "patrones": [
        "Cuántos créditos llevo",
        "Cómo veo mis créditos escolares",
        "Dónde consulto mis créditos acumulados",
        "No sé cuántos créditos me faltan",
        "Quiero ver mi avance de plan de estudios",
        "Cuántos créditos necesito para titularme",
        "Mis créditos no se ven completos",
        "Créditos acumulados UAdeC",
        "Historial académico créditos",
        "Cómo revisar mi avance curricular",
        "Créditos por materia",
        "Ayuda con mis créditos escolares"
      ],
      "respuestas": [
        "Tus créditos escolares se pueden consultar en el portal de alumnos, en el historial académico o en la sección de avance de plan de estudios.",
        "Para revisar tus créditos, entra al sistema institucional de la UAdeC y busca tu historial académico. Ahí verás las materias cursadas y los créditos acumulados.",
        "Si notas algún crédito faltante o un error en tu avance, acude al departamento escolar de tu facultad para que revisen tu situación."
      ]
    },
    {
      "etiqueta": "info_contacto_escolar",
      "patrones": [
        "Necesito el correo de escolar",
        "Con quién me comunico en escolar",
        "Teléfono de escolar UAdeC",
        "Cuál es el contacto de servicios escolares",
        "Dónde están las oficinas de escolar",
        "Horario de atención de escolar",
        "Con quién veo mis dudas de reinscripción",
        "A quién le pregunto sobre mis pagos",
        "Quiero el correo de control escolar",
        "Contacto de control escolar UAdeC",
        "Necesito comunicarme con escolar",
        "Servicio escolar datos de contacto"
      ],
      "respuestas": [
        "El contacto de Escolar puede variar según tu facultad. Te recomiendo revisar la página oficial de tu facultad dentro del sitio de la UAdeC, en la sección de directorio o contacto.",
        "Normalmente, el correo y teléfono de Escolar aparecen publicados en la página web de la facultad. También puedes preguntar directamente en ventanilla.",
        "Para dudas específicas de reinscripción, pagos o historial académico, el departamento escolar de tu facultad es el área indicada. Consulta su correo institucional en el directorio."
      ]
    },
    {
      "etiqueta": "ayuda_general",
      "patrones": [
        "No sé qué preguntar",
        "Me puedes explicar qué haces",
        "Qué tipo de trámites manejas",
        "En qué me puedes ayudar",
        "No entiendo cómo funciona este chatbot",
        "Ayuda general",
        "Qué dudas puedo resolver aquí",
        "Explícame qué trámites atiendes",
        "Qué información tienes",
        "No sé por dónde empezar",
        "Qué opciones de ayuda tienes",
        "Dime qué puedes hacer por mí"
      ],
      "respuestas": [
        "Puedo ayudarte con información general sobre pagos de semestre, créditos educativos, cuotas de mantenimiento, estado de cuenta, horarios, calendario escolar y contacto con Escolar.",
        "Soy un asistente virtual de la UAdeC. Puedo orientarte en trámites frecuentes, pero no reemplazo la atención oficial de escolar o finanzas.",
        "Intenta preguntarme algo específico, por ejemplo: 'cómo pagar el semestre', 'ver mi estado de cuenta', 'ayuda con mi horario' o 'dónde veo el calendario escolar'."
      ]
    }
  ]
}